<!-- terraform cdk action for options with hash 83399a4e9d7710ae2142b8d36b001811 -->
### ✅ Successfully planned Terraform CDK Stack 'hc22-gitops-cdktf'



<details><summary>Show Plan</summary>

```shell
hc22-gitops-cdktf  Initializing Terraform Cloud...
hc22-gitops-cdktf  Initializing provider plugins...
hc22-gitops-cdktf  - Finding hashicorp/aws versions matching "5.31.0"...
hc22-gitops-cdktf  - Installing hashicorp/aws v5.31.0...
hc22-gitops-cdktf  - Installed hashicorp/aws v5.31.0 (signed by HashiCorp)

                   Terraform has created a lock file .terraform.lock.hcl to record the provider
                   selections it made above. Include this file in your version control repository
                   so that Terraform can guarantee to make the same selections by default when
                   you run "terraform init" in the future.
hc22-gitops-cdktf  Terraform Cloud has been successfully initialized!

                   You may now begin working with Terraform Cloud. Try running "terraform plan" to
                   see any changes that are required for your infrastructure.

                   If you ever set or change modules or Terraform Settings, run "terraform init"
                   again to reinitialize your working directory.
hc22-gitops-cdktf  - Fetching hashicorp/aws 5.31.0 for linux_amd64...
hc22-gitops-cdktf  - Retrieved hashicorp/aws 5.31.0 for linux_amd64 (signed by HashiCorp)
                   - Obtained hashicorp/aws checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
hc22-gitops-cdktf  Success! Terraform has validated the lock file and found no need for changes.
hc22-gitops-cdktf  Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
                   will stop streaming the logs, but will not stop the plan running remotely.

                   Preparing the remote plan...
hc22-gitops-cdktf  To view this run in a browser, visit:
                   https://app.terraform.io/app/dbarr-org/cdktf-gitops/runs/run-R4b4gMEMA7UcxcU8
hc22-gitops-cdktf  Waiting for the plan to start...
hc22-gitops-cdktf  Terraform v1.5.3
                   on linux_amd64
                   Initializing plugins and modules...
hc22-gitops-cdktf  Terraform used the selected providers to generate the following execution
                   plan. Resource actions are indicated with the following symbols:
                     + create

                   Terraform will perform the following actions:
hc22-gitops-cdktf  # aws_instance.compute (compute) will be created
                     + resource "aws_instance" "compute" {
                         + ami                                  = "ami-08a9dc8f6d1c4f806"
                         + arn                                  = (known after apply)
                         + associate_public_ip_address          = (known after apply)
                         + availability_zone                    = (known after apply)
                         + cpu_core_count                       = (known after apply)
                         + cpu_threads_per_core                 = (known after apply)
                         + disable_api_stop                     = (known after apply)
                         + disable_api_termination              = (known after apply)
                         + ebs_optimized                        = (known after apply)
                         + get_password_data                    = false
                         + host_id                              = (known after apply)
                         + host_resource_group_arn              = (known after apply)
                         + iam_instance_profile                 = (known after apply)
                         + id                                   = (known after apply)
                         + instance_initiated_shutdown_behavior = (known after apply)
                         + instance_lifecycle                   = (known after apply)
                         + instance_state                       = (known after apply)
                         + instance_type                        = "t2.micro"
                         + ipv6_address_count                   = (known after apply)
                         + ipv6_addresses                       = (known after apply)
                         + key_name                             = (known after apply)
                         + monitoring                           = (known after apply)
                         + outpost_arn                          = (known after apply)
                         + password_data                        = (known after apply)
                         + placement_group                      = (known after apply)
                         + placement_partition_number           = (known after apply)
                         + primary_network_interface_id         = (known after apply)
                         + private_dns                          = (known after apply)
                         + private_ip                           = (known after apply)
                         + public_dns                           = (known after apply)
                         + public_ip                            = (known after apply)
                         + secondary_private_ips                = (known after apply)
                         + security_groups                      = (known after apply)
                         + source_dest_check                    = true
                         + spot_instance_request_id             = (known after apply)
                         + subnet_id                            = (known after apply)
                         + tags                                 = {
                             + "Name" = "CDKTF-Demo"
                           }
                         + tags_all                             = {
                             + "Name" = "CDKTF-Demo"
                           }
                         + tenancy                              = (known after apply)
                         + user_data                            = (known after apply)
                         + user_data_base64                     = (known after apply)
                         + user_data_replace_on_change          = false
                         + vpc_security_group_ids               = (known after apply)
                       }

                   Plan: 1 to add, 0 to change, 0 to destroy.

                   Changes to Outputs:
                     + public_ip = (known after apply)
hc22-gitops-cdktf  ------------------------------------------------------------------------
hc22-gitops-cdktf  Organization Policy Check:

                   ============= Results for policy set: sentinel-cloud-agnostic-full =============

                   Sentinel Result: true

                   This result means that all Sentinel policies passed and the protected
                   behavior is allowed.
hc22-gitops-cdktf  22 policies evaluated.

                   ## Policy 1: sentinel-cloud-agnostic-full/require-all-resources-from-pmr (advisory)

                   Result: false

                   Description:
                     This policy uses the tfconfig/v2 import to require that all non-root  modules come from the Private Module Registry and that no resources  or data sources are created in the root module.

                   Print messages:

                   Resources and data sources are not allowed in the root module.
                   Your root module has 1 resources and data sources.

                   ./require-all-resources-from-pmr.sentinel:54:1 - Rule "main"
                     Value:
                       false

                   ## Policy 2: sentinel-cloud-agnostic-full/allowed-datasources (advisory)

                   Result: true

                   Description:
                     This policy uses the tfconfig/v2 import to allow data sources  contained in an allowed list

                   ./allowed-datasources.sentinel:21:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 3: sentinel-cloud-agnostic-full/allowed-providers (advisory)

                   Result: true

                   Description:
                     This policy uses the tfconfig/v2 import to restrict providers to those  in an allowed list.

                   ./allowed-providers.sentinel:78:1 - Rule "main"
                     Value:
                       true

                   ## Policy 4: sentinel-cloud-agnostic-full/allowed-provisioners (advisory)

                   Result: true

                   Description:
                     This policy uses the tfconfig/v2 import to specified provisioners  in an allowed list

                   ./allowed-provisioners.sentinel:23:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 5: sentinel-cloud-agnostic-full/allowed-resources (advisory)

                   Result: true

                   Description:
                     This policy uses the tfconfig/v2 import to allow resources  from an allowed list

                   ./allowed-resources.sentinel:21:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 6: sentinel-cloud-agnostic-full/limit-cost-and-percentage-increase (advisory)

                   Result: true

                   Description:
                     This policy uses the Sentinel tfrun import to restrict the  both the total monthly cost and the percentage increase in  the monthly cost that would be incurred if the current plan  were applied

                   Print messages:

                   No cost estimates available

                   ./limit-cost-and-percentage-increase.sentinel:21:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 7: sentinel-cloud-agnostic-full/limit-cost-by-workspace-name (advisory)

                   Result: true

                   Description:
                     This policy uses the Sentinel tfrun import to restrict the  proposed monthly cost that would be incurred if the current  plan were applied, using different limits for different  workspaces based on their names.

                   Print messages:

                   No cost estimates available

                   ./limit-cost-by-workspace-name.sentinel:24:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 8: sentinel-cloud-agnostic-full/limit-proposed-monthly-cost (advisory)

                   Result: true

                   Description:
                     This policy uses the Sentinel tfrun import to restrict the  proposed monthly cost that would be incurred if the current  plan were applied

                   Print messages:

                   No cost estimates available

                   ./limit-proposed-monthly-cost.sentinel:19:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 9: sentinel-cloud-agnostic-full/prevent-destruction-of-prohibited-resources (advisory)

                   Result: true

                   Description:
                     This policy prevents the destruction without re-creation of resources  of prohibited types.

                   ./prevent-destruction-of-prohibited-resources.sentinel:22:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 10: sentinel-cloud-agnostic-full/prevent-non-root-providers (advisory)

                   Result: true

                   Description:
                     This policy uses the tfconfig/v2 import to prevent providers from being  created in non-root modules. Only provider proxy configuration blocks  that do not have any config are allowed.

                   Print messages:

                   Providers that are not proxy configuration blocks are only allowed in the root module.

                   ./prevent-non-root-providers.sentinel:36:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 11: sentinel-cloud-agnostic-full/prevent-remote-exec-provisioners-on-null-resources (advisory)

                   Result: true

                   Description:
                     This policy uses the tfconfig/v2 import to prevent remote-exec provisioners  from being used on null resources

                   Print messages:

                   remote-exec provisioners are not allowed on null resources.

                   ./prevent-remote-exec-provisioners-on-null-resources.sentinel:24:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 12: sentinel-cloud-agnostic-full/prohibited-datasources (advisory)

                   Result: true
hc22-gitops-cdktf  Description:
                     This policy uses the tfconfig/v2 import to prohibit data sources  in a prohibited list

                   ./prohibited-datasources.sentinel:20:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 13: sentinel-cloud-agnostic-full/prohibited-providers (advisory)

                   Result: true

                   Description:
                     This policy uses the tfconfig/v2 import to prohibit providers  from a prohibited list

                   ./prohibited-providers.sentinel:64:1 - Rule "main"
                     Value:
                       true

                   ## Policy 14: sentinel-cloud-agnostic-full/prohibited-provisioners (advisory)

                   Result: true

                   Description:
                     This policy uses the tfconfig/v2 import to prohibit specified provisioners  from a prohibited list

                   ./prohibited-provisioners.sentinel:23:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 15: sentinel-cloud-agnostic-full/prohibited-resources (advisory)

                   Result: true

                   Description:
                     This policy uses the tfconfig/v2 import to prohibit resources  from a prohibited list

                   ./prohibited-resources.sentinel:20:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 16: sentinel-cloud-agnostic-full/require-all-modules-have-version-constraint (advisory)

                   Result: true

                   Description:
                     This policy uses the tfconfig/v2 import to require modules to have  version constraint, this is a good practise.

                   ./require-all-modules-have-version-constraint.sentinel:24:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 17: sentinel-cloud-agnostic-full/require-all-providers-have-version-constraint (advisory)

                   Result: true

                   Description:
                     This policy uses the tfconfig/v2 import to require providers to have  version constraint, this is a good practise.

                   ./require-all-providers-have-version-constraint.sentinel:23:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 18: sentinel-cloud-agnostic-full/restrict-databricks-clusters (advisory)

                   Result: true

                   Description:
                     This policy uses the Sentinel tfplan/v2 import to restrict the  max number of workers in Databricks clusters and the sizes of their VMs

                   ./restrict-databricks-clusters.sentinel:40:1 - Rule "main"
                     Value:
                       true

                   ## Policy 19: sentinel-cloud-agnostic-full/restrict-panos-srgs (advisory)

                   Result: true

                   Description:
                     This policy uses the Sentinel tfplan/v2 import to restrict the  destination addresses of Palo Alto Networks security rule groups  to not have "any".

                   ./restrict-panos-srgs.sentinel:35:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 20: sentinel-cloud-agnostic-full/restrict-remote-state (advisory)

                   Result: true

                   Description:
                     This policy uses the Sentinel tfstate and tfrun imports to restrict the  workspaces from which remote state can be retrieved using the  terraform_remote_state data source. It provides a map between  prefixes and suffixes of names of workspaces that want to read remote state  and specific workspaces from which they can read it.

                   ./restrict-remote-state.sentinel:91:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 21: sentinel-cloud-agnostic-full/restrict-resources-by-module-source (advisory)

                   Result: true

                   Description:
                     This policy restricts resources of specific types to only be created in  modules with sources in a given list of modules from public and private module  registries or in their nested modules.  If you want to allow creation of the resources in the root module, include  "root" in the `allowed_module_sources` list. But you generally would not  want to allow "root" since that sacrifices most control over creation of  the resource types in `restricted_resources`.  Note that this policy allows creation of resources in module blocks that  point directly against a sub-directory of a module with a reference like  "app.terraform.io/Cloud-Operations/s3-bucket/aws//modules/notification".

                   ./restrict-resources-by-module-source.sentinel:143:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true

                   ## Policy 22: sentinel-cloud-agnostic-full/validate-variables-have-descriptions (advisory)

                   Result: true

                   Description:
                     This policy uses the tfconfig/v2 import to validate that all variables  have descriptions

                   ./validate-variables-have-descriptions.sentinel:24:1 - Rule "main"
                     Description:
                       Main rule

                     Value:
                       true


```

</details>